In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Deepu', 'Chandu', 'Mehek', 'Chintu'],
    "marks":[85, 70, 91, 30],
    "city":['Bengaluru', 'Hyderabad', 'Lucknow', 'Delhi']
}

In [3]:
dataframe = pd.DataFrame(dict1)

In [4]:
dataframe

     name  marks       city
0   Deepu     85  Bengaluru
1  Chandu     70  Hyderabad
2   Mehek     91    Lucknow
3  Chintu     30      Delhi

In [5]:
dataframe.to_csv('demo_csv1')

In [6]:
dataframe.to_csv('demo_csv1_index_false.csv', index=False)

In [7]:
dataframe.head(2)

     name  marks       city
0   Deepu     85  Bengaluru
1  Chandu     70  Hyderabad

In [8]:
dataframe.tail(2)

     name  marks     city
2   Mehek     91  Lucknow
3  Chintu     30    Delhi

In [9]:
dataframe.describe()

          marks
count   4.00000
mean   69.00000
std    27.45906
min    30.00000
25%    60.00000
50%    77.50000
75%    86.50000
max    91.00000

In [10]:
train_df = pd.read_csv('train_read_csv.csv')

In [11]:
train_df

   train_no station_city            train_name
0    123321    Hyderabad        Konark Express
1    333771    Bengaluru      Prasanti Express
2    637290       Odisha  Faluknamma Superfast
3    739202     Kolkatta     Howrah Yesmantpur
4    242627      Chennai          chennai mail
5    345272         Puri     Puri Durg Express

In [12]:
train_df['train_no']

0    123321
1    333771
2    637290
3    739202
4    242627
5    345272
Name: train_no, dtype: int64

In [13]:
train_df['train_no'][0] = 222222

C:\Users\Futurense\AppData\Local\Temp\ipykernel_29692\1948925443.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['train_no'][0] = 222222

In [14]:
train_df

   train_no station_city            train_name
0    222222    Hyderabad        Konark Express
1    333771    Bengaluru      Prasanti Express
2    637290       Odisha  Faluknamma Superfast
3    739202     Kolkatta     Howrah Yesmantpur
4    242627      Chennai          chennai mail
5    345272         Puri     Puri Durg Express

In [27]:
train_df.dtypes

train_no         int64
station_city    object
train_name      object
dtype: object

# Note : if we specify the file_name which we read earlier that file will be update

# Here, I used different diff_file_name.

In [15]:
train_df.to_csv('afterreadupdate_write_train.csv',index = False)

In [16]:
train_df.index = ['1st','2nd','3rd','4th','5th','6th']

In [17]:
train_df

     train_no station_city            train_name
1st    222222    Hyderabad        Konark Express
2nd    333771    Bengaluru      Prasanti Express
3rd    637290       Odisha  Faluknamma Superfast
4th    739202     Kolkatta     Howrah Yesmantpur
5th    242627      Chennai          chennai mail
6th    345272         Puri     Puri Durg Express

In [18]:
seriz = pd.Series(np.random.rand(34))

In [19]:
type(seriz)

pandas.core.series.Series

In [20]:
seriz

0     0.139143
1     0.631265
2     0.470873
3     0.757875
4     0.452634
5     0.702591
6     0.451968
7     0.403321
8     0.928759
9     0.641544
10    0.120240
11    0.895311
12    0.930979
13    0.210371
14    0.067866
15    0.166838
16    0.301049
17    0.657558
18    0.897413
19    0.408655
20    0.757143
21    0.857804
22    0.126721
23    0.533498
24    0.376626
25    0.512677
26    0.106407
27    0.311328
28    0.688208
29    0.669707
30    0.243091
31    0.345320
32    0.179924
33    0.984539
dtype: float64

In [21]:
new_datafarame = pd.DataFrame(np.random.rand(300, 5), index = np.arange(300))

In [22]:
new_datafarame

            0         1         2         3         4
0    0.622887  0.948148  0.877362  0.973701  0.333681
1    0.324048  0.373892  0.453980  0.417492  0.200408
2    0.385404  0.499447  0.840519  0.169399  0.005913
3    0.106559  0.936489  0.810815  0.561778  0.563097
4    0.888059  0.046318  0.593693  0.445592  0.523242
..        ...       ...       ...       ...       ...
295  0.781398  0.543645  0.411393  0.682467  0.319938
296  0.682007  0.635257  0.780971  0.844556  0.074977
297  0.614548  0.744245  0.945205  0.936168  0.157381
298  0.244182  0.646241  0.571618  0.366967  0.504723
299  0.084360  0.748833  0.342162  0.165746  0.434448

[300 rows x 5 columns]

In [23]:
type(new_datafarame)

pandas.core.frame.DataFrame

In [24]:
new_datafarame.describe()

                0           1           2           3           4
count  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.528079    0.513930    0.515355    0.486799    0.496090
std      0.297429    0.298282    0.289211    0.292720    0.278863
min      0.003459    0.002945    0.002316    0.005421    0.004660
25%      0.258752    0.237530    0.260906    0.235729    0.238536
50%      0.522380    0.525090    0.543859    0.466255    0.537821
75%      0.809388    0.771365    0.746783    0.735563    0.706237
max      0.988794    0.995928    0.998856    0.998583    0.994472

In [26]:
new_datafarame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
new_datafarame.head()

          0         1         2         3         4
0  0.622887  0.948148  0.877362  0.973701  0.333681
1  0.324048  0.373892  0.453980  0.417492  0.200408
2  0.385404  0.499447  0.840519  0.169399  0.005913
3  0.106559  0.936489  0.810815  0.561778  0.563097
4  0.888059  0.046318  0.593693  0.445592  0.523242

In [30]:
new_datafarame[0][1] = "Deepu"
new_datafarame.head()

          0         1         2         3         4
0  0.622887  0.948148  0.877362  0.973701  0.333681
1     Deepu  0.373892  0.453980  0.417492  0.200408
2  0.385404  0.499447  0.840519  0.169399  0.005913
3  0.106559  0.936489  0.810815  0.561778  0.563097
4  0.888059  0.046318  0.593693  0.445592  0.523242

In [38]:
new_datafarame.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
295    False
296    False
297    False
298    False
299    False
Length: 300, dtype: bool

In [40]:
new_datafarame.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            290, 291, 292, 293, 294, 295, 296, 297, 298, 299],
           dtype='int64', length=300)

In [41]:
new_datafarame.columns

RangeIndex(start=0, stop=5, step=1)

# convert a array to numpy array